# WSScript_SetResImage

## Description
This function must be used inside a worksheet script called by 'RunScript' worksheet formula.<BR>
<BR>
Set the result of the worksheet script to the object to be used as image in the cell.

```pascal
PROCEDURE WSScript_SetResImage(h : HANDLE);
```

```python
def vs.WSScript_SetResImage(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|The handle of the object that will be used for image in the cell.|

## See Also
VS Functions:
WSScript_GetObject
| WSScript_GetPrmInt
| WSScript_GetPrmReal
| WSScript_GetPrmStr
| WSScript_SetResStr
| WSScript_SetResReal
| WSScript_SetResImage

## Version
Availability: from Vectorworks 2016

## Category
* Worksheets